SandiaFlame_RANS/0/H
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      c;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1907;

boundaryField
{
    wallTube
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }

    inletPilot
    {
        type            fixedValue;
        value           uniform -170863.69815950916;
    }

    inletAir
    {
        type            fixedValue;
        value           uniform 35298.7;
    }

    wallOutside
    {
        type            zeroGradient;
    }

    inletCH4
    {
        type            fixedValue;
        value           uniform -714081.00107;
    }

    axis
    {
        type            empty;
    }
    
    frontAndBack_pos
    {
        type            wedge;
    }
    frontAndBack_neg
    {
        type            wedge;
    }


}


// ************************************************************************* //
