SandiaFlame_RANS/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chenFlaReFoam_Nandula;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.5;

deltaT          5e-2;

writeControl    adjustableRunTime;

writeInterval   100e-3;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression on;

timeFormat      general;

timePrecision   9;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.8;

maxAlphaCo      1;

maxDeltaT       1;

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ //

combustion      true;

//betacDynamic    true;

//staticForm      true;

bufferTime        0.5;

//DpDt            true;

// Pim             true;

// ignition        false;

ignBeginTime    0.3;

//incomp_P_operate	101325;

T_flamelet	false;
// ************************************************************************* //
//collectStats    true;

//statsBeginTime  2.03504;

//probing         true;

//writeJump         132e-3;

//integrateHRR    true;


// libs ("libOpenFOAM.so");
//libs ("libWALE.so");
//libs ("libmixGCDSM.so");
